Repository: POWEHI2023/TravelScheduler
Catalog: TravelScheduler/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

# common.apple_maps
source: Apple 地图
en: Apple Maps
zh_hant: Apple 地圖

# common.close
source: 关闭
en: Close
zh_hant: 關閉

# common.delete
source: 删除
en: Delete
zh_hant: 刪除

# common.done
source: 完成
en: Done

# common.no
source: 否
en: No

# common.place
source: 地点
en: Place
zh_hant: 地點

# common.unnamed_place
source: 未命名地点
en: Untitled Place
zh_hant: 未命名地點

# common.warning_label
source: 提示
en: Note

# common.yes
source: 是
en: Yes

# content.button.locate_route
source: 定位路线
en: Fit Route
zh_hant: 定位路線

# content.button.settings
source: 设置
en: Settings
zh_hant: 設定

# content.navigation.title
source: 旅行地图
en: Travel Map
zh_hant: 旅行地圖

# markdown.address
source: 地址：%@
en: Address: %@

# markdown.current_status
source: 当前状态：%@
en: Current status: %@
zh_hant: 目前狀態：%@

# markdown.end
source: 终点：%@
en: End: %@
zh_hant: 終點：%@

# markdown.generated_at
source: 生成时间：%@
en: Generated at: %@
zh_hant: 產生時間：%@

# markdown.is_loop
source: 是否环线：%@
en: Loop route: %@
zh_hant: 是否環線：%@

# markdown.no_places
source: 暂无地点
en: No places
zh_hant: 暫無地點

# markdown.no_route
source: 暂无已生成路线。
en: No generated route yet.
zh_hant: 暫無已產生路線。

# markdown.route_order
source: 路线顺序：%@
en: Route order: %@
zh_hant: 路線順序：%@

# markdown.section.overview
source: 概览
en: Overview
zh_hant: 概覽

# markdown.section.places
source: 地点列表
en: Places
zh_hant: 地點列表

# markdown.section.segments
source: 分段规划
en: Segment Plan
zh_hant: 分段規劃

# markdown.segment.duration
source: 通行时间：%@
en: Travel time: %@
zh_hant: 通行時間：%@

# markdown.segment.mode
source: 通行方式：%@
en: Travel mode: %@

# markdown.segment.start_end
source: 起止：%@ → %@
en: From/To: %@ → %@

# markdown.segment.title
source: 第%lld段
en: Segment %lld

# markdown.start
source: 起点：%@
en: Start: %@
zh_hant: 起點：%@

# markdown.title
source: 路线规划文档
en: Route Plan Document
zh_hant: 路線規劃文件

# markdown.total_distance
source: 总路程：%@
en: Total distance: %@
zh_hant: 總路程：%@

# markdown.total_distance_transit_note
source: 总路程：%@（不含需在 Apple 地图中查看的公共交通实际轨迹）
en: Total distance: %@ (excluding actual transit paths that must be viewed in Apple Maps)
zh_hant: 總路程：%@（不含需在 Apple 地圖中查看的大眾運輸實際軌跡）

# markdown.total_duration
source: 总时长：%@
en: Total duration: %@
zh_hant: 總時長：%@

# markdown.travel_suggestion
source: 行程建议：%@
en: Trip suggestion: %@
zh_hant: 行程建議：%@

# route_plan_document.copied_accessibility
source: 已复制规划内容
en: Route plan copied
zh_hant: 已複製規劃內容

# route_plan_document.copied_to_clipboard
source: 已复制到剪贴板
en: Copied to clipboard
zh_hant: 已複製到剪貼簿

# route_plan_document.copy_accessibility
source: 复制规划内容
en: Copy route plan
zh_hant: 複製規劃內容

# route_plan_document.empty_description
source: 请先生成路线，再创建路线规划文档。
en: Generate a route before creating the route plan document.
zh_hant: 請先產生路線，再建立路線規劃文件。

# route_plan_document.empty_title
source: 暂无路线规划内容
en: No route plan available
zh_hant: 暫無路線規劃內容

# route_plan_document.title
source: 路线规划文档
en: Route Plan Document
zh_hant: 路線規劃文件

# route.adjustment.end_adjusted
source: 终点已调整为%@
en: End adjusted to %@
zh_hant: 終點已調整為%@

# route.adjustment.end_synced
source: 终点已同步为%@
en: End synced to %@
zh_hant: 終點已同步為%@

# route.adjustment.start_adjusted
source: 起点已调整为%@
en: Start adjusted to %@
zh_hant: 起點已調整為%@

# route.details.button_title
source: 查看分段路线（%lld段）
en: View Route Segments (%lld)
zh_hant: 查看分段路線（%lld段）

# route.legend.external_accessibility
source: 该段需在 Apple 地图中查看
en: This segment must be viewed in Apple Maps
zh_hant: 此分段需在 Apple 地圖中查看

# route.segment.details_in_apple_maps
source: %@ · 详情见 Apple 地图
en: %@ · Details in Apple Maps
zh_hant: %@ · 詳情見 Apple 地圖

# route.segment.estimated_duration
source: 预计时长：%@
en: Estimated time: %@
zh_hant: 預計時長：%@

# route.segment.header
source: 第%1$lld段：%2$@ → %3$@
en: Segment %1$lld: %2$@ → %3$@

# route.segment.hide_details
source: 收起详细路线
en: Hide detailed route
zh_hant: 收起詳細路線

# route.segment.mode.original_selection
source: %1$@（原选择：%2$@）
en: %1$@ (Originally selected: %2$@)
zh_hant: %1$@（原選擇：%2$@）

# route.segment.no_details
source: 暂无更详细步骤信息
en: No detailed steps available
zh_hant: 暫無更詳細步驟資訊

# route.segment.open_in_apple_maps
source: 在 Apple 地图中查看
en: View in Apple Maps
zh_hant: 在 Apple 地圖中查看

# route.segment.ordinal
source: 第%lld段
en: Segment %lld

# route.segment.preferences
source: 偏好：%@
en: Preferences: %@

# route.segment.provider_handles_details
source: %@ 承接详细路线
en: %@ provides the detailed route
zh_hant: %@ 承接詳細路線

# route.segment.show_details
source: 显示详细路线
en: Show detailed route
zh_hant: 顯示詳細路線

# route.segments.title
source: 分段路线
en: Route Segments
zh_hant: 分段路線

# route.service.apple_maps_transit_route_name
source: Apple 地图公共交通
en: Apple Maps Transit
zh_hant: Apple 地圖大眾運輸

# route.service.continue_to_destination
source: 继续前往目的地
en: Continue to destination
zh_hant: 繼續前往目的地

# route.service.coordinate_fallback
source: 纬度 %.4f, 经度 %.4f
en: Lat %.4f, Lon %.4f
zh_hant: 緯度 %.4f，經度 %.4f

# route.service.mode_failed
source: %@计算失败
en: Failed to calculate %@
zh_hant: %@計算失敗

# route.service.mode_not_found
source: 未找到%@可达路线
en: No reachable %@ route found
zh_hant: 未找到%@可達路線

# route.service.mode_unavailable
source: %@暂不可用
en: %@ is currently unavailable
zh_hant: %@暫不可用

# route.service.preferred_route_fallback
source: 未找到%@可达路线，已改用%@计算。
en: No reachable %@ route was found, using %@ instead.
zh_hant: 未找到%@可達路線，已改用%@計算。

# route.service.request_throttled
source: 地图服务请求过于频繁
en: Map service requests are too frequent
zh_hant: 地圖服務請求過於頻繁

# route.service.same_coordinate
source: 该分段起终点坐标相同，已按原地停留处理。
en: This segment starts and ends at the same coordinates and is treated as staying in place.
zh_hant: 該分段起終點座標相同，已按原地停留處理。

# route.service.straight_line_after_reason
source: %@，已使用直线连接。
en: %@, so a straight line is used instead.
zh_hant: %@，已使用直線連接。

# route.service.transit_fallback_mode
source: 原选择为公共交通，当前地区/时段未找到可用公交方案，已改用%@计算。
en: Transit was selected originally, but no transit option was found for this area/time, using %@ instead.
zh_hant: 原選擇為大眾運輸，當前地區或時段未找到可用方案，已改用%@計算。

# route.service.transit_no_solution_no_fallback
source: 原选择为公共交通，当前地区/时段未找到可用公交方案，且无法改用步行或驾车，已使用直线连接。
en: Transit was selected originally, but no transit option was found for this area/time and walking or driving fallback also failed, so a straight line is used.
zh_hant: 原選擇為大眾運輸，當前地區或時段未找到可用方案，且無法改用步行或駕車，已使用直線連接。

# route.service.unable_to_calculate_straight_line
source: 该分段无法通过地图服务计算，已使用直线连接。
en: This segment couldn't be calculated by Maps and now uses a straight line.
zh_hant: 該分段無法透過地圖服務計算，已使用直線連接。

# route.service.unavailable
source: 地图服务暂时不可用
en: Map service is temporarily unavailable
zh_hant: 地圖服務暫時不可用

# route.stop_role.end
source: （终点）
en: (End)
zh_hant: （終點）

# route.stop_role.start
source: （起点）
en: (Start)
zh_hant: （起點）

# route.stop_role.start_end
source: （起点 / 终点）
en: (Start / End)
zh_hant: （起點 / 終點）

# settings.delete_accessibility
source: 删除%@
en: Delete %@
zh_hant: 刪除%@

# settings.route.actual_generation_order
source: 实际生成顺序
en: Generated Order
zh_hant: 實際產生順序

# settings.route.add_places_first
source: 请先添加地点
en: Add places first
zh_hant: 請先加入地點

# settings.route.end
source: 终点
en: End
zh_hant: 終點

# settings.route.generate
source: 生成路线
en: Generate Route
zh_hant: 產生路線

# settings.route.generate_document
source: 生成路线规划文档
en: Generate Route Plan Document
zh_hant: 產生路線規劃文件

# settings.route.loading
source: 路线计算中...
en: Calculating route...
zh_hant: 路線計算中...

# settings.route.loop_toggle
source: 终点与起点相同（环线）
en: End same as start (loop)
zh_hant: 終點與起點相同（環線）

# settings.route.no_in_app_distance_for_transit
source: 部分公共交通分段不提供应用内路程估算
en: Some transit segments don't provide in-app distance estimates
zh_hant: 部分大眾運輸分段不提供 App 內距離估算

# settings.route.start
source: 起点
en: Start
zh_hant: 起點

# settings.route.total_distance
source: 总路程：%@
en: Total distance: %@
zh_hant: 總路程：%@

# settings.route.total_duration
source: 总时长：%@
en: Total duration: %@
zh_hant: 總時長：%@

# settings.search.add_accessibility
source: 添加%@到行程
en: Add %@ to itinerary
zh_hant: 將%@加入行程

# settings.search.add_to_itinerary
source: 添加到行程
en: Add to Itinerary
zh_hant: 加入行程

# settings.search.loading
source: 搜索中...
en: Searching...
zh_hant: 搜尋中...

# settings.search.placeholder
source: 输入景点、地标或地址
en: Enter a sight, landmark, or address
zh_hant: 輸入景點、地標或地址

# settings.section.route_planning
source: 路线规划
en: Route Planning
zh_hant: 路線規劃

# settings.section.search
source: 搜索地点
en: Search Places
zh_hant: 搜尋地點

# settings.section.segment_modes
source: 分段通行方式
en: Segment Travel Modes

# settings.section.selected_places
source: 已选地点
en: Selected Places
zh_hant: 已選地點

# settings.segment_modes.empty_description
source: 至少添加两个地点并确认起终点后可配置每一段的通行方式
en: Add at least two places and confirm start/end to configure each segment
zh_hant: 至少加入兩個地點並確認起終點後，才能設定各分段的通行方式

# settings.segment_modes.empty_title
source: 暂无可配置分段
en: No configurable segments
zh_hant: 暫無可設定分段

# settings.segment_modes.picker_label
source: 第%lld段通行方式
en: Segment %lld travel mode

# settings.selected_places.empty
source: 还没有添加地点
en: No places added yet
zh_hant: 尚未加入地點

# settings.title
source: 设置
en: Settings
zh_hant: 設定

# status.route.added
source: 已添加：%@
en: Added: %@
zh_hant: 已加入：%@

# status.route.cannot_calculate
source: 无法计算路线，请尝试更换地点或出行方式。
en: Unable to calculate the route. Try different places or travel modes.
zh_hant: 無法計算路線，請嘗試更換地點或通行方式。

# status.route.deleted
source: 已删除：%@
en: Deleted: %@
zh_hant: 已刪除：%@

# status.route.end_updated
source: 终点已更新
en: End updated
zh_hant: 終點已更新

# status.route.external_transit
source: 部分公共交通分段需在 Apple 地图中查看详细路线。
en: Some transit segments need to be viewed in Apple Maps for full details.
zh_hant: 部分大眾運輸分段需在 Apple 地圖中查看詳細路線。

# status.route.generation_failed
source: 路线计算失败：%@
en: Route calculation failed: %@
zh_hant: 路線計算失敗：%@

# status.route.invalidate
source: 请重新生成路线。
en: Please regenerate the route.
zh_hant: 請重新產生路線。

# status.route.loop_disabled
source: 已切换为非环线
en: Switched to non-loop route
zh_hant: 已切換為非環線

# status.route.loop_enabled
source: 已切换为环线
en: Switched to loop route
zh_hant: 已切換為環線

# status.route.minimum_stops
source: 至少需要两个地点才能生成路线。
en: At least two places are required to generate a route.
zh_hant: 至少需要兩個地點才能產生路線。

# status.route.order_updated
source: 顺序已更新
en: Order updated
zh_hant: 順序已更新

# status.route.segment_mode_updated
source: 分段通行方式已更新
en: Segment travel mode updated

# status.route.start_updated
source: 起点已更新
en: Start updated
zh_hant: 起點已更新

# status.route.transit_fallback
source: 部分公共交通分段未找到可用公交方案，已改用步行或驾车。
en: Some transit segments were unavailable and have been replaced with walking or driving.
zh_hant: 部分大眾運輸分段未找到可用方案，已改為步行或駕車。

# status.route.updated_segments
source: 路线已更新，共 %lld 段。
en: Route updated with %lld segments.
zh_hant: 路線已更新，共 %lld 段。

# status.route.updated_with_fallback
source: 路线已更新，但部分分段使用了替代方式或直线估算。
en: Route updated, but some segments use fallback modes or straight-line estimates.
zh_hant: 路線已更新，但部分分段使用了替代方式或直線估算。

# status.search.duplicate_place
source: 该地点已在行程中。
en: This place is already in the itinerary.
zh_hant: 該地點已在行程中。

# status.search.failed
source: 搜索失败：%@
en: Search failed: %@
zh_hant: 搜尋失敗：%@

# status.search.no_results
source: 未找到相关地点，请尝试更具体的关键词。
en: No matching places found. Try a more specific keyword.
zh_hant: 未找到相關地點，請嘗試更具體的關鍵字。

# suggestion.full_day
source: 建议：这条路线适合一天内完成。
en: Suggestion: This route can be completed within a day.
zh_hant: 建議：這條路線適合一天內完成。

# suggestion.half_day
source: 建议：这条路线适合半日轻量行程。
en: Suggestion: This route suits a light half-day trip.
zh_hant: 建議：這條路線適合半日輕量行程。

# suggestion.long
source: 建议：这条路线较长，建议分两天或增加中途休息点。
en: Suggestion: This route is long; consider splitting it across two days or adding rest stops.
zh_hant: 建議：這條路線較長，建議分兩天或增加中途休息點。

# suggestion.needs_route
source: 添加至少两个地点后可生成路线建议
en: Add at least two places to get route suggestions
zh_hant: 至少加入兩個地點後才能產生路線建議

# transit.preference.bus
source: 公交
en: Bus
zh_hant: 公車

# transit.preference.commuter
source: 通勤铁路
en: Commuter Rail
zh_hant: 通勤鐵路

# transit.preference.ferry
source: 轮渡
en: Ferry
zh_hant: 渡輪

# transit.preference.subway
source: 地铁
en: Subway
zh_hant: 地鐵

# transit.provider.apple_maps
source: Apple 地图
en: Apple Maps
zh_hant: Apple 地圖

# travel_mode.driving
source: 驾车
en: Driving
zh_hant: 駕車

# travel_mode.transit
source: 公共交通
en: Transit
zh_hant: 大眾運輸

# travel_mode.walking
source: 步行
en: Walking
